summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_ACS_Bits.VFRB */
#define IFX_ERAY_ACS_VFRB_OFF (8)

/** \\brief  Length for Ifx_ERAY_CCEV_Bits.CCFC */
#define IFX_ERAY_CCEV_CCFC_LEN (4)

/** \\brief  Mask for Ifx_ERAY_CCEV_Bits.CCFC */
#define IFX_ERAY_CCEV_CCFC_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_CCEV_Bits.CCFC */
#define IFX_ERAY_CCEV_CCFC_OFF (0)

/** \\brief  Length for Ifx_ERAY_CCEV_Bits.ERRM */
#define IFX_ERAY_CCEV_ERRM_LEN (2)

/** \\brief  Mask for Ifx_ERAY_CCEV_Bits.ERRM */
#define IFX_ERAY_CCEV_ERRM_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_CCEV_Bits.ERRM */
#define IFX_ERAY_CCEV_ERRM_OFF (6)

/** \\brief  Length for Ifx_ERAY_CCEV_Bits.PTAC */
#define IFX_ERAY_CCEV_PTAC_LEN (5)

/** \\brief  Mask for Ifx_ERAY_CCEV_Bits.PTAC */
#define IFX_ERAY_CCEV_PTAC_MSK (0x1f)

/** \\brief  Offset for Ifx_ERAY_CCEV_Bits.PTAC */
#define IFX_ERAY_CCEV_PTAC_OFF (8)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.CSAI */
#define IFX_ERAY_CCSV_CSAI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.CSAI */
#define IFX_ERAY_CCSV_CSAI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.CSAI */
#define IFX_ERAY_CCSV_CSAI_OFF (13)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.CSI */
#define IFX_ERAY_CCSV_CSI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.CSI */
#define IFX_ERAY_CCSV_CSI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.CSI */
#define IFX_ERAY_CCSV_CSI_OFF (14)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.CSNI */
#define IFX_ERAY_CCSV_CSNI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.CSNI */
#define IFX_ERAY_CCSV_CSNI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.CSNI */
#define IFX_ERAY_CCSV_CSNI_OFF (12)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.FSI */
#define IFX_ERAY_CCSV_FSI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.FSI */
#define IFX_ERAY_CCSV_FSI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.FSI */
#define IFX_ERAY_CCSV_FSI_OFF (6)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.HRQ */
#define IFX_ERAY_CCSV_HRQ_LEN (1)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.HRQ */
#define IFX_ERAY_CCSV_HRQ_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.HRQ */
#define IFX_ERAY_CCSV_HRQ_OFF (7)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.POCS */
#define IFX_ERAY_CCSV_POCS_LEN (6)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.POCS */
#define IFX_ERAY_CCSV_POCS_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.POCS */
#define IFX_ERAY_CCSV_POCS_OFF (0)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.PSL */
#define IFX_ERAY_CCSV_PSL_LEN (6)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.PSL */
#define IFX_ERAY_CCSV_PSL_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.PSL */
#define IFX_ERAY_CCSV_PSL_OFF (24)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.RCA */
#define IFX_ERAY_CCSV_RCA_LEN (5)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.RCA */
#define IFX_ERAY_CCSV_RCA_MSK (0x1f)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.RCA */
#define IFX_ERAY_CCSV_RCA_OFF (19)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.SLM */
#define IFX_ERAY_CCSV_SLM_LEN (2)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.SLM */
#define IFX_ERAY_CCSV_SLM_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.SLM */
#define IFX_ERAY_CCSV_SLM_OFF (8)

/** \\brief  Length for Ifx_ERAY_CCSV_Bits.WSV */
#define IFX_ERAY_CCSV_WSV_LEN (3)

/** \\brief  Mask for Ifx_ERAY_CCSV_Bits.WSV */
#define IFX_ERAY_CCSV_WSV_MSK (0x7)

/** \\brief  Offset for Ifx_ERAY_CCSV_Bits.WSV */
#define IFX_ERAY_CCSV_WSV_OFF (16)

/** \\brief  Length for Ifx_ERAY_CLC_Bits.DISR */
#define IFX_ERAY_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_CLC_Bits.DISR */
#define IFX_ERAY_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_CLC_Bits.DISR */
#define IFX_ERAY_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_ERAY_CLC_Bits.DISS */
#define IFX_ERAY_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_CLC_Bits.DISS */
#define IFX_ERAY_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_CLC_Bits.DISS */
#define IFX_ERAY_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_ERAY_CLC_Bits.EDIS */
#define IFX_ERAY_CLC_EDIS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_CLC_Bits.EDIS */
#define IFX_ERAY_CLC_EDIS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_CLC_Bits.EDIS */
#define IFX_ERAY_CLC_EDIS_OFF (3)

/** \\brief  Length for Ifx_ERAY_CLC_Bits.RMC */
#define IFX_ERAY_CLC_RMC_LEN (3)

/** \\brief  Mask for Ifx_ERAY_CLC_Bits.RMC */
#define IFX_ERAY_CLC_RMC_MSK (0x7)

/** \\brief  Offset for Ifx_ERAY_CLC_Bits.RMC */
#define IFX_ERAY_CLC_RMC_OFF (8)

/** \\brief  Length for Ifx_ERAY_CREL_Bits.DAY */
#define IFX_ERAY_CREL_DAY_LEN (8)

/** \\brief  Mask for Ifx_ERAY_CREL_Bits.DAY */
#define IFX_ERAY_CREL_DAY_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_CREL_Bits.DAY */
#define IFX_ERAY_CREL_DAY_OFF (0)

/** \\brief  Length for Ifx_ERAY_CREL_Bits.MON */
#define IFX_ERAY_CREL_MON_LEN (8)

/** \\brief  Mask for Ifx_ERAY_CREL_Bits.MON */
#define IFX_ERAY_CREL_MON_MSK (0xff)

/** \\brief  Offset for Ifx_ERAY_CREL_Bits.MON */
#define IFX_ERAY_CREL_MON_OFF (8)

/** \\brief  Length for Ifx_ERAY_CREL_Bits.REL */
#define IFX_ERAY_CREL_REL_LEN (4)

/** \\brief  Mask for Ifx_ERAY_CREL_Bits.REL */
#define IFX_ERAY_CREL_REL_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_CREL_Bits.REL */
#define IFX_ERAY_CREL_REL_OFF (28)

/** \\brief  Length for Ifx_ERAY_CREL_Bits.STEP */
#define IFX_ERAY_CREL_STEP_LEN (4)

/** \\brief  Mask for Ifx_ERAY_CREL_Bits.STEP */
#define IFX_ERAY_CREL_STEP_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_CREL_Bits.STEP */
#define IFX_ERAY_CREL_STEP_OFF (24)

/** \\brief  Length for Ifx_ERAY_CREL_Bits.SUBSTEP */
#define IFX_ERAY_CREL_SUBSTEP_LEN (4)

/** \\brief  Mask for Ifx_ERAY_CREL_Bits.SUBSTEP */
#define IFX_ERAY_CREL_SUBSTEP_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_CREL_Bits.SUBSTEP */
#define IFX_ERAY_CREL_SUBSTEP_OFF (20)

/** \\brief  Length for Ifx_ERAY_CREL_Bits.YEAR */
#define IFX_ERAY_CREL_YEAR_LEN (4)

/** \\brief  Mask for Ifx_ERAY_CREL_Bits.YEAR */
#define IFX_ERAY_CREL_YEAR_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_CREL_Bits.YEAR */
#define IFX_ERAY_CREL_YEAR_OFF (16)

/** \\brief  Length for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_LEN (1)

