summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC43 */
#define IFX_ERAY_MBSC2_MBC43_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC43 */
#define IFX_ERAY_MBSC2_MBC43_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC43 */
#define IFX_ERAY_MBSC2_MBC43_OFF (11)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC44 */
#define IFX_ERAY_MBSC2_MBC44_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC44 */
#define IFX_ERAY_MBSC2_MBC44_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC44 */
#define IFX_ERAY_MBSC2_MBC44_OFF (12)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC45 */
#define IFX_ERAY_MBSC2_MBC45_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC45 */
#define IFX_ERAY_MBSC2_MBC45_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC45 */
#define IFX_ERAY_MBSC2_MBC45_OFF (13)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC46 */
#define IFX_ERAY_MBSC2_MBC46_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC46 */
#define IFX_ERAY_MBSC2_MBC46_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC46 */
#define IFX_ERAY_MBSC2_MBC46_OFF (14)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC47 */
#define IFX_ERAY_MBSC2_MBC47_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC47 */
#define IFX_ERAY_MBSC2_MBC47_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC47 */
#define IFX_ERAY_MBSC2_MBC47_OFF (15)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC48 */
#define IFX_ERAY_MBSC2_MBC48_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC48 */
#define IFX_ERAY_MBSC2_MBC48_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC48 */
#define IFX_ERAY_MBSC2_MBC48_OFF (16)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC49 */
#define IFX_ERAY_MBSC2_MBC49_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC49 */
#define IFX_ERAY_MBSC2_MBC49_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC49 */
#define IFX_ERAY_MBSC2_MBC49_OFF (17)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC50 */
#define IFX_ERAY_MBSC2_MBC50_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC50 */
#define IFX_ERAY_MBSC2_MBC50_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC50 */
#define IFX_ERAY_MBSC2_MBC50_OFF (18)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC51 */
#define IFX_ERAY_MBSC2_MBC51_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC51 */
#define IFX_ERAY_MBSC2_MBC51_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC51 */
#define IFX_ERAY_MBSC2_MBC51_OFF (19)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC52 */
#define IFX_ERAY_MBSC2_MBC52_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC52 */
#define IFX_ERAY_MBSC2_MBC52_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC52 */
#define IFX_ERAY_MBSC2_MBC52_OFF (20)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC53 */
#define IFX_ERAY_MBSC2_MBC53_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC53 */
#define IFX_ERAY_MBSC2_MBC53_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC53 */
#define IFX_ERAY_MBSC2_MBC53_OFF (21)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC54 */
#define IFX_ERAY_MBSC2_MBC54_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC54 */
#define IFX_ERAY_MBSC2_MBC54_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC54 */
#define IFX_ERAY_MBSC2_MBC54_OFF (22)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC55 */
#define IFX_ERAY_MBSC2_MBC55_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC55 */
#define IFX_ERAY_MBSC2_MBC55_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC55 */
#define IFX_ERAY_MBSC2_MBC55_OFF (23)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC56 */
#define IFX_ERAY_MBSC2_MBC56_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC56 */
#define IFX_ERAY_MBSC2_MBC56_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC56 */
#define IFX_ERAY_MBSC2_MBC56_OFF (24)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC57 */
#define IFX_ERAY_MBSC2_MBC57_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC57 */
#define IFX_ERAY_MBSC2_MBC57_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC57 */
#define IFX_ERAY_MBSC2_MBC57_OFF (25)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC58 */
#define IFX_ERAY_MBSC2_MBC58_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC58 */
#define IFX_ERAY_MBSC2_MBC58_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC58 */
#define IFX_ERAY_MBSC2_MBC58_OFF (26)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC59 */
#define IFX_ERAY_MBSC2_MBC59_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC59 */
#define IFX_ERAY_MBSC2_MBC59_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC59 */
#define IFX_ERAY_MBSC2_MBC59_OFF (27)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC60 */
#define IFX_ERAY_MBSC2_MBC60_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC60 */
#define IFX_ERAY_MBSC2_MBC60_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC60 */
#define IFX_ERAY_MBSC2_MBC60_OFF (28)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC61 */
#define IFX_ERAY_MBSC2_MBC61_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC61 */
#define IFX_ERAY_MBSC2_MBC61_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC61 */
#define IFX_ERAY_MBSC2_MBC61_OFF (29)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC62 */
#define IFX_ERAY_MBSC2_MBC62_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC62 */
#define IFX_ERAY_MBSC2_MBC62_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC62 */
#define IFX_ERAY_MBSC2_MBC62_OFF (30)

/** \\brief  Length for Ifx_ERAY_MBSC2_Bits.MBC63 */
#define IFX_ERAY_MBSC2_MBC63_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC2_Bits.MBC63 */
#define IFX_ERAY_MBSC2_MBC63_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC2_Bits.MBC63 */
#define IFX_ERAY_MBSC2_MBC63_OFF (31)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC64 */
#define IFX_ERAY_MBSC3_MBC64_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC64 */
#define IFX_ERAY_MBSC3_MBC64_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC64 */
#define IFX_ERAY_MBSC3_MBC64_OFF (0)

