summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP10 */
#define IFX_ERAY_MSIC1_MSIP10_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP10 */
#define IFX_ERAY_MSIC1_MSIP10_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP10 */
#define IFX_ERAY_MSIC1_MSIP10_OFF (10)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP11 */
#define IFX_ERAY_MSIC1_MSIP11_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP11 */
#define IFX_ERAY_MSIC1_MSIP11_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP11 */
#define IFX_ERAY_MSIC1_MSIP11_OFF (11)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP12 */
#define IFX_ERAY_MSIC1_MSIP12_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP12 */
#define IFX_ERAY_MSIC1_MSIP12_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP12 */
#define IFX_ERAY_MSIC1_MSIP12_OFF (12)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP13 */
#define IFX_ERAY_MSIC1_MSIP13_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP13 */
#define IFX_ERAY_MSIC1_MSIP13_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP13 */
#define IFX_ERAY_MSIC1_MSIP13_OFF (13)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP14 */
#define IFX_ERAY_MSIC1_MSIP14_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP14 */
#define IFX_ERAY_MSIC1_MSIP14_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP14 */
#define IFX_ERAY_MSIC1_MSIP14_OFF (14)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP15 */
#define IFX_ERAY_MSIC1_MSIP15_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP15 */
#define IFX_ERAY_MSIC1_MSIP15_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP15 */
#define IFX_ERAY_MSIC1_MSIP15_OFF (15)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP16 */
#define IFX_ERAY_MSIC1_MSIP16_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP16 */
#define IFX_ERAY_MSIC1_MSIP16_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP16 */
#define IFX_ERAY_MSIC1_MSIP16_OFF (16)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP17 */
#define IFX_ERAY_MSIC1_MSIP17_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP17 */
#define IFX_ERAY_MSIC1_MSIP17_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP17 */
#define IFX_ERAY_MSIC1_MSIP17_OFF (17)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP18 */
#define IFX_ERAY_MSIC1_MSIP18_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP18 */
#define IFX_ERAY_MSIC1_MSIP18_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP18 */
#define IFX_ERAY_MSIC1_MSIP18_OFF (18)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP19 */
#define IFX_ERAY_MSIC1_MSIP19_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP19 */
#define IFX_ERAY_MSIC1_MSIP19_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP19 */
#define IFX_ERAY_MSIC1_MSIP19_OFF (19)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_OFF (1)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP20 */
#define IFX_ERAY_MSIC1_MSIP20_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP20 */
#define IFX_ERAY_MSIC1_MSIP20_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP20 */
#define IFX_ERAY_MSIC1_MSIP20_OFF (20)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP21 */
#define IFX_ERAY_MSIC1_MSIP21_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP21 */
#define IFX_ERAY_MSIC1_MSIP21_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP21 */
#define IFX_ERAY_MSIC1_MSIP21_OFF (21)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP22 */
#define IFX_ERAY_MSIC1_MSIP22_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP22 */
#define IFX_ERAY_MSIC1_MSIP22_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP22 */
#define IFX_ERAY_MSIC1_MSIP22_OFF (22)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP23 */
#define IFX_ERAY_MSIC1_MSIP23_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP23 */
#define IFX_ERAY_MSIC1_MSIP23_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP23 */
#define IFX_ERAY_MSIC1_MSIP23_OFF (23)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP24 */
#define IFX_ERAY_MSIC1_MSIP24_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP24 */
#define IFX_ERAY_MSIC1_MSIP24_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP24 */
#define IFX_ERAY_MSIC1_MSIP24_OFF (24)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP25 */
#define IFX_ERAY_MSIC1_MSIP25_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP25 */
#define IFX_ERAY_MSIC1_MSIP25_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP25 */
#define IFX_ERAY_MSIC1_MSIP25_OFF (25)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP26 */
#define IFX_ERAY_MSIC1_MSIP26_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP26 */
#define IFX_ERAY_MSIC1_MSIP26_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP26 */
#define IFX_ERAY_MSIC1_MSIP26_OFF (26)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP27 */
#define IFX_ERAY_MSIC1_MSIP27_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP27 */
#define IFX_ERAY_MSIC1_MSIP27_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP27 */
#define IFX_ERAY_MSIC1_MSIP27_OFF (27)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP28 */
#define IFX_ERAY_MSIC1_MSIP28_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP28 */
#define IFX_ERAY_MSIC1_MSIP28_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP28 */
#define IFX_ERAY_MSIC1_MSIP28_OFF (28)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_OFF (29)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_MSK (0x1)

