summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND49 */
#define IFX_ERAY_NDAT2_ND49_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND49 */
#define IFX_ERAY_NDAT2_ND49_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND50 */
#define IFX_ERAY_NDAT2_ND50_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND50 */
#define IFX_ERAY_NDAT2_ND50_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND50 */
#define IFX_ERAY_NDAT2_ND50_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND51 */
#define IFX_ERAY_NDAT2_ND51_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND51 */
#define IFX_ERAY_NDAT2_ND51_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND51 */
#define IFX_ERAY_NDAT2_ND51_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND52 */
#define IFX_ERAY_NDAT2_ND52_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND52 */
#define IFX_ERAY_NDAT2_ND52_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND52 */
#define IFX_ERAY_NDAT2_ND52_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND53 */
#define IFX_ERAY_NDAT2_ND53_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND53 */
#define IFX_ERAY_NDAT2_ND53_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND53 */
#define IFX_ERAY_NDAT2_ND53_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND54 */
#define IFX_ERAY_NDAT2_ND54_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND54 */
#define IFX_ERAY_NDAT2_ND54_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND54 */
#define IFX_ERAY_NDAT2_ND54_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND55 */
#define IFX_ERAY_NDAT2_ND55_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND55 */
#define IFX_ERAY_NDAT2_ND55_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND55 */
#define IFX_ERAY_NDAT2_ND55_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND56 */
#define IFX_ERAY_NDAT2_ND56_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND56 */
#define IFX_ERAY_NDAT2_ND56_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND56 */
#define IFX_ERAY_NDAT2_ND56_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND57 */
#define IFX_ERAY_NDAT2_ND57_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND57 */
#define IFX_ERAY_NDAT2_ND57_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND57 */
#define IFX_ERAY_NDAT2_ND57_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND58 */
#define IFX_ERAY_NDAT2_ND58_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND58 */
#define IFX_ERAY_NDAT2_ND58_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND58 */
#define IFX_ERAY_NDAT2_ND58_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND59 */
#define IFX_ERAY_NDAT2_ND59_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND59 */
#define IFX_ERAY_NDAT2_ND59_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND59 */
#define IFX_ERAY_NDAT2_ND59_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND60 */
#define IFX_ERAY_NDAT2_ND60_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND60 */
#define IFX_ERAY_NDAT2_ND60_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND60 */
#define IFX_ERAY_NDAT2_ND60_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND61 */
#define IFX_ERAY_NDAT2_ND61_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND61 */
#define IFX_ERAY_NDAT2_ND61_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND61 */
#define IFX_ERAY_NDAT2_ND61_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND62 */
#define IFX_ERAY_NDAT2_ND62_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND62 */
#define IFX_ERAY_NDAT2_ND62_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND62 */
#define IFX_ERAY_NDAT2_ND62_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDAT2_Bits.ND63 */
#define IFX_ERAY_NDAT2_ND63_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT2_Bits.ND63 */
#define IFX_ERAY_NDAT2_ND63_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT2_Bits.ND63 */
#define IFX_ERAY_NDAT2_ND63_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_OFF (8)

