summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND80 */
#define IFX_ERAY_NDAT3_ND80_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND80 */
#define IFX_ERAY_NDAT3_ND80_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND80 */
#define IFX_ERAY_NDAT3_ND80_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND81 */
#define IFX_ERAY_NDAT3_ND81_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND81 */
#define IFX_ERAY_NDAT3_ND81_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND81 */
#define IFX_ERAY_NDAT3_ND81_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND82 */
#define IFX_ERAY_NDAT3_ND82_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND82 */
#define IFX_ERAY_NDAT3_ND82_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND82 */
#define IFX_ERAY_NDAT3_ND82_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND83 */
#define IFX_ERAY_NDAT3_ND83_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND83 */
#define IFX_ERAY_NDAT3_ND83_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND83 */
#define IFX_ERAY_NDAT3_ND83_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND84 */
#define IFX_ERAY_NDAT3_ND84_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND84 */
#define IFX_ERAY_NDAT3_ND84_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND84 */
#define IFX_ERAY_NDAT3_ND84_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND85 */
#define IFX_ERAY_NDAT3_ND85_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND85 */
#define IFX_ERAY_NDAT3_ND85_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND85 */
#define IFX_ERAY_NDAT3_ND85_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND86 */
#define IFX_ERAY_NDAT3_ND86_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND86 */
#define IFX_ERAY_NDAT3_ND86_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND86 */
#define IFX_ERAY_NDAT3_ND86_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND87 */
#define IFX_ERAY_NDAT3_ND87_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND87 */
#define IFX_ERAY_NDAT3_ND87_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND87 */
#define IFX_ERAY_NDAT3_ND87_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND88 */
#define IFX_ERAY_NDAT3_ND88_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND88 */
#define IFX_ERAY_NDAT3_ND88_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND88 */
#define IFX_ERAY_NDAT3_ND88_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND89 */
#define IFX_ERAY_NDAT3_ND89_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND89 */
#define IFX_ERAY_NDAT3_ND89_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND89 */
#define IFX_ERAY_NDAT3_ND89_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND90 */
#define IFX_ERAY_NDAT3_ND90_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND90 */
#define IFX_ERAY_NDAT3_ND90_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND90 */
#define IFX_ERAY_NDAT3_ND90_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND91 */
#define IFX_ERAY_NDAT3_ND91_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND91 */
#define IFX_ERAY_NDAT3_ND91_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND91 */
#define IFX_ERAY_NDAT3_ND91_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND92 */
#define IFX_ERAY_NDAT3_ND92_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND92 */
#define IFX_ERAY_NDAT3_ND92_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND92 */
#define IFX_ERAY_NDAT3_ND92_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND93 */
#define IFX_ERAY_NDAT3_ND93_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND93 */
#define IFX_ERAY_NDAT3_ND93_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND93 */
#define IFX_ERAY_NDAT3_ND93_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND94 */
#define IFX_ERAY_NDAT3_ND94_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND94 */
#define IFX_ERAY_NDAT3_ND94_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND94 */
#define IFX_ERAY_NDAT3_ND94_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDAT3_Bits.ND95 */
#define IFX_ERAY_NDAT3_ND95_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT3_Bits.ND95 */
#define IFX_ERAY_NDAT3_ND95_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT3_Bits.ND95 */
#define IFX_ERAY_NDAT3_ND95_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND100 */
#define IFX_ERAY_NDAT4_ND100_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND100 */
#define IFX_ERAY_NDAT4_ND100_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND100 */
#define IFX_ERAY_NDAT4_ND100_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND101 */
#define IFX_ERAY_NDAT4_ND101_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND101 */
#define IFX_ERAY_NDAT4_ND101_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND101 */
#define IFX_ERAY_NDAT4_ND101_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND102 */
#define IFX_ERAY_NDAT4_ND102_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND102 */
#define IFX_ERAY_NDAT4_ND102_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND102 */
#define IFX_ERAY_NDAT4_ND102_OFF (6)

