summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP60 */
#define IFX_ERAY_NDIC2_NDIP60_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP61 */
#define IFX_ERAY_NDIC2_NDIP61_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP61 */
#define IFX_ERAY_NDIC2_NDIP61_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP61 */
#define IFX_ERAY_NDIC2_NDIP61_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP62 */
#define IFX_ERAY_NDIC2_NDIP62_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP62 */
#define IFX_ERAY_NDIC2_NDIP62_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP62 */
#define IFX_ERAY_NDIC2_NDIP62_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP63 */
#define IFX_ERAY_NDIC2_NDIP63_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP63 */
#define IFX_ERAY_NDIC2_NDIP63_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP63 */
#define IFX_ERAY_NDIC2_NDIP63_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP64 */
#define IFX_ERAY_NDIC3_NDIP64_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP64 */
#define IFX_ERAY_NDIC3_NDIP64_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP64 */
#define IFX_ERAY_NDIC3_NDIP64_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP65 */
#define IFX_ERAY_NDIC3_NDIP65_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP65 */
#define IFX_ERAY_NDIC3_NDIP65_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP65 */
#define IFX_ERAY_NDIC3_NDIP65_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP66 */
#define IFX_ERAY_NDIC3_NDIP66_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP66 */
#define IFX_ERAY_NDIC3_NDIP66_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP66 */
#define IFX_ERAY_NDIC3_NDIP66_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP67 */
#define IFX_ERAY_NDIC3_NDIP67_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP67 */
#define IFX_ERAY_NDIC3_NDIP67_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP67 */
#define IFX_ERAY_NDIC3_NDIP67_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP68 */
#define IFX_ERAY_NDIC3_NDIP68_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP68 */
#define IFX_ERAY_NDIC3_NDIP68_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP68 */
#define IFX_ERAY_NDIC3_NDIP68_OFF (4)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP69 */
#define IFX_ERAY_NDIC3_NDIP69_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP69 */
#define IFX_ERAY_NDIC3_NDIP69_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP69 */
#define IFX_ERAY_NDIC3_NDIP69_OFF (5)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP70 */
#define IFX_ERAY_NDIC3_NDIP70_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP70 */
#define IFX_ERAY_NDIC3_NDIP70_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP70 */
#define IFX_ERAY_NDIC3_NDIP70_OFF (6)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP71 */
#define IFX_ERAY_NDIC3_NDIP71_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP71 */
#define IFX_ERAY_NDIC3_NDIP71_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP71 */
#define IFX_ERAY_NDIC3_NDIP71_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP72 */
#define IFX_ERAY_NDIC3_NDIP72_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP72 */
#define IFX_ERAY_NDIC3_NDIP72_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP72 */
#define IFX_ERAY_NDIC3_NDIP72_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP73 */
#define IFX_ERAY_NDIC3_NDIP73_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP73 */
#define IFX_ERAY_NDIC3_NDIP73_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP73 */
#define IFX_ERAY_NDIC3_NDIP73_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP74 */
#define IFX_ERAY_NDIC3_NDIP74_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP74 */
#define IFX_ERAY_NDIC3_NDIP74_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP74 */
#define IFX_ERAY_NDIC3_NDIP74_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP75 */
#define IFX_ERAY_NDIC3_NDIP75_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP75 */
#define IFX_ERAY_NDIC3_NDIP75_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP75 */
#define IFX_ERAY_NDIC3_NDIP75_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP76 */
#define IFX_ERAY_NDIC3_NDIP76_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP76 */
#define IFX_ERAY_NDIC3_NDIP76_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP76 */
#define IFX_ERAY_NDIC3_NDIP76_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP77 */
#define IFX_ERAY_NDIC3_NDIP77_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP77 */
#define IFX_ERAY_NDIC3_NDIP77_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP77 */
#define IFX_ERAY_NDIC3_NDIP77_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP78 */
#define IFX_ERAY_NDIC3_NDIP78_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP78 */
#define IFX_ERAY_NDIC3_NDIP78_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP78 */
#define IFX_ERAY_NDIC3_NDIP78_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP79 */
#define IFX_ERAY_NDIC3_NDIP79_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP79 */
#define IFX_ERAY_NDIC3_NDIP79_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP79 */
#define IFX_ERAY_NDIC3_NDIP79_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP80 */
#define IFX_ERAY_NDIC3_NDIP80_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP80 */
#define IFX_ERAY_NDIC3_NDIP80_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP80 */
#define IFX_ERAY_NDIC3_NDIP80_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP81 */
#define IFX_ERAY_NDIC3_NDIP81_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP81 */
#define IFX_ERAY_NDIC3_NDIP81_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP81 */
#define IFX_ERAY_NDIC3_NDIP81_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDIC3_Bits.NDIP82 */
#define IFX_ERAY_NDIC3_NDIP82_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC3_Bits.NDIP82 */
#define IFX_ERAY_NDIC3_NDIP82_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC3_Bits.NDIP82 */
#define IFX_ERAY_NDIC3_NDIP82_OFF (18)

