summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP110 */
#define IFX_ERAY_NDIC4_NDIP110_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP110 */
#define IFX_ERAY_NDIC4_NDIP110_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP110 */
#define IFX_ERAY_NDIC4_NDIP110_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP111 */
#define IFX_ERAY_NDIC4_NDIP111_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP111 */
#define IFX_ERAY_NDIC4_NDIP111_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP111 */
#define IFX_ERAY_NDIC4_NDIP111_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP112 */
#define IFX_ERAY_NDIC4_NDIP112_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP112 */
#define IFX_ERAY_NDIC4_NDIP112_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP112 */
#define IFX_ERAY_NDIC4_NDIP112_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP113 */
#define IFX_ERAY_NDIC4_NDIP113_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP113 */
#define IFX_ERAY_NDIC4_NDIP113_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP113 */
#define IFX_ERAY_NDIC4_NDIP113_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP114 */
#define IFX_ERAY_NDIC4_NDIP114_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP114 */
#define IFX_ERAY_NDIC4_NDIP114_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP114 */
#define IFX_ERAY_NDIC4_NDIP114_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP115 */
#define IFX_ERAY_NDIC4_NDIP115_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP115 */
#define IFX_ERAY_NDIC4_NDIP115_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP115 */
#define IFX_ERAY_NDIC4_NDIP115_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP116 */
#define IFX_ERAY_NDIC4_NDIP116_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP116 */
#define IFX_ERAY_NDIC4_NDIP116_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP116 */
#define IFX_ERAY_NDIC4_NDIP116_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP117 */
#define IFX_ERAY_NDIC4_NDIP117_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP117 */
#define IFX_ERAY_NDIC4_NDIP117_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP117 */
#define IFX_ERAY_NDIC4_NDIP117_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP118 */
#define IFX_ERAY_NDIC4_NDIP118_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP118 */
#define IFX_ERAY_NDIC4_NDIP118_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP118 */
#define IFX_ERAY_NDIC4_NDIP118_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP119 */
#define IFX_ERAY_NDIC4_NDIP119_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP119 */
#define IFX_ERAY_NDIC4_NDIP119_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP119 */
#define IFX_ERAY_NDIC4_NDIP119_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP120 */
#define IFX_ERAY_NDIC4_NDIP120_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP120 */
#define IFX_ERAY_NDIC4_NDIP120_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP120 */
#define IFX_ERAY_NDIC4_NDIP120_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP121 */
#define IFX_ERAY_NDIC4_NDIP121_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP121 */
#define IFX_ERAY_NDIC4_NDIP121_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP121 */
#define IFX_ERAY_NDIC4_NDIP121_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP122 */
#define IFX_ERAY_NDIC4_NDIP122_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP122 */
#define IFX_ERAY_NDIC4_NDIP122_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP122 */
#define IFX_ERAY_NDIC4_NDIP122_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP123 */
#define IFX_ERAY_NDIC4_NDIP123_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP123 */
#define IFX_ERAY_NDIC4_NDIP123_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP123 */
#define IFX_ERAY_NDIC4_NDIP123_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP124 */
#define IFX_ERAY_NDIC4_NDIP124_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP124 */
#define IFX_ERAY_NDIC4_NDIP124_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP124 */
#define IFX_ERAY_NDIC4_NDIP124_OFF (28)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP125 */
#define IFX_ERAY_NDIC4_NDIP125_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP125 */
#define IFX_ERAY_NDIC4_NDIP125_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP125 */
#define IFX_ERAY_NDIC4_NDIP125_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP126 */
#define IFX_ERAY_NDIC4_NDIP126_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP126 */
#define IFX_ERAY_NDIC4_NDIP126_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP126 */
#define IFX_ERAY_NDIC4_NDIP126_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP127 */
#define IFX_ERAY_NDIC4_NDIP127_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP127 */
#define IFX_ERAY_NDIC4_NDIP127_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP127 */
#define IFX_ERAY_NDIC4_NDIP127_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP96 */
#define IFX_ERAY_NDIC4_NDIP96_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP96 */
#define IFX_ERAY_NDIC4_NDIP96_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP96 */
#define IFX_ERAY_NDIC4_NDIP96_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP97 */
#define IFX_ERAY_NDIC4_NDIP97_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP97 */
#define IFX_ERAY_NDIC4_NDIP97_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP97 */
#define IFX_ERAY_NDIC4_NDIP97_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP98 */
#define IFX_ERAY_NDIC4_NDIP98_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP98 */
#define IFX_ERAY_NDIC4_NDIP98_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP98 */
#define IFX_ERAY_NDIC4_NDIP98_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDIC4_Bits.NDIP99 */
#define IFX_ERAY_NDIC4_NDIP99_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC4_Bits.NDIP99 */
#define IFX_ERAY_NDIC4_NDIP99_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC4_Bits.NDIP99 */
#define IFX_ERAY_NDIC4_NDIP99_OFF (3)

