summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_OFF (9)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_LEN (4)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_OFF (24)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_LEN (4)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_OFF (28)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_OFF (1)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_OFF (16)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_OFF (17)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_LEN (2)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_OFF (4)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_OFF (18)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_OFF (19)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_OFF (20)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_OFF (21)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_OFF (0)

/** \\brief  Length for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_LEN (3)

/** \\brief  Mask for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_MSK (0x7)

/** \\brief  Offset for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_OFF (0)

/** \\brief  Length for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_LEN (3)

/** \\brief  Mask for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_MSK (0x7)

/** \\brief  Offset for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_OFF (4)

/** \\brief  Length for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_OFF (14)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_OFF (0)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_OFF (10)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_OFF (11)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_OFF (12)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_OFF (13)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_OFF (14)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_OFF (15)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_OFF (16)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_OFF (17)

